## 시리즈를 데이터프레임으로 만들기

In [1]:
import pandas as pd

In [5]:
raw_data =  {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
'age': [42, 52, 36, 24, 73],
'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

## 'read_확장자' 함수로 데이터 바로 로딩

In [7]:
# 데이터 URL을 변수 data_url에 넣기
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
# csv 데이터 로드
df_data = pd.read_csv(data_url, sep='\s+', header = None)
df = pd.DataFrame(df_data)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [10]:
pd_l = [1,2,3,4,5]
pd_data = pd.DataFrame(pd_l)
pd_data

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
type(pd_data)

pandas.core.frame.DataFrame

In [12]:
pd_data['1열']=pd_l
pd_data

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [13]:
pd_name= ['a', 'b','c','d','e']
pd_data['이름']=pd_name
pd_data

   0  1열 이름
0  1   1  a
1  2   2  b
2  3   3  c
3  4   4  d
4  5   5  e

In [15]:
pd_data2=pd_data.rename(columns={0:'0열'})
pd_data2

   0열  1열 이름
0   1   1  a
1   2   2  b
2   3   3  c
3   4   4  d
4   5   5  e

In [17]:
score = [["정약용", 70, 80, 100],
        ["이순신", 100, 80, 70],
        ["이율곡", 90, 95, 90]
        ]
score

[['정약용', 70, 80, 100], ['이순신', 100, 80, 70], ['이율곡', 90, 95, 90]]

In [18]:
type(score)

list

In [21]:
#데이터 프레임화 하기
score_df=pd.DataFrame(score)
score_df

     0    1   2    3
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [24]:
# 컬럼명 수정(처음 지정)
score_df.columns = ['이름', '국어', '영어', '수학']
score_df

    이름   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [25]:
#이미 생성된 컬럼명변경(국어->korean...) 중괄호, 작은따옴표 주의!
score_df_temp=score_df.rename(columns={'국어':'Kor', '영어':'Eng'})
score_df_temp

    이름  Kor  Eng   수학
0  정약용   70   80  100
1  이순신  100   80   70
2  이율곡   90   95   90

## 딕셔너리를 데이터프레임으로 만들기
딕셔너리는키값이 있으므로

In [35]:
score_dic = {'성명' : ["정약용", "이순신", "이율곡"],
             '국어' : [70, 100, 90],
             '영어' : [80, 80, 95],
             '수학' : [100, 70, 90]
            }
score_dic

{'성명': ['정약용', '이순신', '이율곡'],
 '국어': [70, 100, 90],
 '영어': [80, 80, 95],
 '수학': [100, 70, 90]}

In [36]:
type(score_dic)

dict

In [37]:
score_dic_df = pd.DataFrame(score_dic)
score_dic_df

    성명   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [39]:
# 총 사이즈 확인.
# 가로,세로 아니고 (세로,가로)임에 주의.
score_dic_df.shape

(3, 4)

In [40]:
df.shape

(506, 14)

In [44]:
#인덱스, 컬럼명, 값 확인하기
score_dic_df.index, score_dic_df.columns, score_dic_df.values

(RangeIndex(start=0, stop=3, step=1),
 Index(['성명', '국어', '영어', '수학'], dtype='object'),
 array([['정약용', 70, 80, 100],
        ['이순신', 100, 80, 70],
        ['이율곡', 90, 95, 90]], dtype=object))

In [46]:
# 성명컬럼은 인덱스로 쓰도록 지정할 수도 있음.
# 혹시 프라이머리키를 따로 지정하는 경우.
score_dic_df.index = score_dic_df['성명']
score_dic_df

      성명   국어  영어   수학
성명
정약용  정약용   70  80  100
이순신  이순신  100  80   70
이율곡  이율곡   90  95   90

In [52]:
# 성명을 인덱스로 지정했으니 컬럼을 지워보자. axis=1 << 세로
# 임시삭제. 원본데이터 프린트하면 안됨ㅎㅎ
score_dic_df.drop(['성명'], axis=1)

      국어  영어   수학
성명
정약용   70  80  100
이순신  100  80   70
이율곡   90  95   90

In [54]:
# row를 지워보자. axis=0 <<가로
score_dic_df.drop(['이순신'], axis=0)

      성명  국어  영어   수학
성명
정약용  정약용  70  80  100
이율곡  이율곡  90  95   90

In [60]:
score_dic_df2=score_dic_df
score_dic_df2

      국어  영어   수학
성명
정약용   70  80  100
이순신  100  80   70
이율곡   90  95   90

In [61]:
score_dic_df2.drop(['수학'], axis=1, inplace=True)
score_dic_df2

      국어  영어
성명
정약용   70  80
이순신  100  80
이율곡   90  95

In [ ]:
# inplace=True << 실제 위치에서도 삭제
score_dic_df.drop(['성명'], axis=1, inplace=True)
score_dic_df